#include "stack_int.h"
#include "two_stacks.h"

// Создать стек для целых чисел. Максимальный размер стека вводится с экрана. Найти сумму
// после максимального элемента стека.

// Создать два стека для целых чисел. Первый стек – организовать ввод по убыванию, второй
// стек – организовать ввод по возрастанию. Без сортировок и переворачивания исходных
// стеков сформировать третий стек упорядоченный по убыванию

// В текстовом файле записаны строки – арифметические выражения. Числа – вещественные,
// знаки действий - -, +, *, / и скобки (). Используя работу со стеками найти значение каждого выражения
// и записать в файл результатов. Если в исходном файле в строке есть ошибка – найти ее предполагаемую
// позицию (позицию первой ошибки) и в выходной файл записать сообщение «Ошибка в позиции N»

//Могильный Владислав Александрович, 30.03.2025

int main(){

    stack_int();
    two_stacks_task();
}
